/*
В JavaScript есть:
                3 Основных типа данных
                2 Составных типа
                и 2 Специальных типа данных


                    3 ОСНОВНЫХ ТИПА ДАННЫХ:
                            (базовые)
    * Строка (String)
    * Число (Number)
    * BOOLEAN (логический)
    
                    2 СОСТАВНЫХ ТИПА ДАННЫХ:
                        составные(ссылочные)
    * Объект (Object)
    * Массив (Array)

                    2 СПЕЦИАЛЬНЫХ ТИПА:
    * Null
    * Не определено (Undefined)
*/


/*
                                String:
-Строковый тип представляет цепочку состоящую из нуля или более знаков Юникода(буквы, цифры, знаки пунктуации)
-Строковый тип используется для представления текста в JavaScript
-Для вкючения строковых литералов используют одинарные или двойные кавычки.
В строках, заключенных в одинарные кавычки можно использовать двойные кавычки. И наоборот.
*/

"Hello World!"
"45"
'c'
'Happy "Anton" work hard!'

//Строка, содержащая ноль знаков ("") - называется пустой строкой или строкой нулевой длины.


